InformationRegisters/МатериальноОтветственныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МатериальноОтветственныеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗонаОтветственности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеАктуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МатериальноОтветственныеЛица/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Заполняет материальную ответственность физических лиц.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - организация физических лиц.
//  ФизическиеЛица - Массив - список физических лиц.
//  МатериальнаяОтветственностьФизическихЛиц - Соответствие - соответствие физических лиц и материальной ответственности.
//
Процедура МатериальнаяОтветственность(Организация, ФизическиеЛица, ТолькоАктуальные, МатериальнаяОтветственностьФизическихЛиц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МатериальноОтветственныеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МатериальноОтветственныеЛица.ЗонаОтветственности КАК ЗонаОтветственности,
		|	ИСТИНА КАК Актуален
		|ИЗ
		|	РегистрСведений.МатериальноОтветственныеЛица КАК МатериальноОтветственныеЛица
		|ГДЕ
		|	МатериальноОтветственныеЛица.Организация = &Организация
		|	И МатериальноОтветственныеЛица.ФизическоеЛицо В(&ФизическиеЛица)
		|	И &ТолькоАктуальные";
	
	Если ТолькоАктуальные Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТолькоАктуальные", "НЕ МатериальноОтветственныеЛица.НеАктуален");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТолькоАктуальные", "ИСТИНА");
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			МатериальнаяОтветственностьФизическихЛиц.Вставить(Выборка.ФизическоеЛицо, Выборка.Актуален);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ФизическоеЛицо",
		"РегламентированныеДанные");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
